<?php

namespace Database\Seeders;

use App\Models\Major;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class MajorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Major::insert([
            ["name" => "Технички науки", "description" => "Техничките науки се фокусираат на примена на инженерски принципи и технологија за решавање на практични проблеми и развој на иновативни решенија."],
            ["name" => "Природни науки", "description" => "Природните науки ја проучуваат природата и универзумот преку физика, хемија, биологија и други научни дисциплини за разбирање на природните закони."],
            ["name" => "Социјални науки", "description" => "Социјалните науки ја анализираат човечката интеракција, општествата и културите, преку дисциплини како психологија, социологија и економија."],
            ["name" => "Уметнички науки", "description" => "Уметничките науки се занимаваат со изразување на креативност и естетика преку ликовна уметност, музика, театар и други облици на уметност."],
            ["name" => "Бизнис и претприемништво", "description" => "Оваа област се фокусира на управување, финансии, маркетинг и развој на бизниси, како и создавање нови претприемачки можности."],
            ["name" => "Наука за медицина", "description" => "Медицинските науки се насочени кон проучување на здравјето, болестите и медицинските третмани за подобрување на квалитетот на живот."],
            ["name" => "Земјоделски науки", "description" => "Земјоделските науки се посветени на одржливо производство на храна, земјоделски практики и управување со природните ресурси."]
        ]);
    }
}
